InformationRegisters/упПлановоеРасписаниеРаботыГаража.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПлановоеРасписаниеРаботыГаража</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Гараж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМестаРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упСтатусыРемонтовИТОТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыРемонтовИТОТС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыРемонтаИТОТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРемонтИТОТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСтатусыРемонтаИТОТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыРемонтаИТОТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/упПлановоеРасписаниеРаботыГаража/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет проверку на пересечение периодов доступности мест ремонта гаража,
// после проведения документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.упРемонтИТОТС - объект документа.
//  Отказ          - Булево - Признак проведения документа.
//
Процедура ВыполнитьКонтрольРезультатовПроведения(ДокументОбъект, Отказ) Экспорт
	
	Гараж        = ДокументОбъект.Гараж;
	МестоРемонта = ДокументОбъект.МестоРемонта;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упПлановоеРасписаниеРаботыГаража.Регистратор,
	|	упПлановоеРасписаниеРаботыГаража.НачалоРемонта КАК ДатаНачала,
	|	упПлановоеРасписаниеРаботыГаража.ОкончаниеРемонта КАК ДатаОкончания
	|ПОМЕСТИТЬ втПериодыДоступностиПодготовка
	|ИЗ
	|	РегистрСведений.упПлановоеРасписаниеРаботыГаража КАК упПлановоеРасписаниеРаботыГаража
	|ГДЕ
	|	упПлановоеРасписаниеРаботыГаража.Гараж = &Гараж
	|	И упПлановоеРасписаниеРаботыГаража.МестоРемонта = &МестоРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	упПлановоеРасписаниеРаботыГаража.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПериодыДоступности.Регистратор,
	|	втПериодыДоступности.ДатаНачала,
	|	втПериодыДоступности.ДатаОкончания
	|ПОМЕСТИТЬ втПериодыДоступности
	|ИЗ
	|	втПериодыДоступностиПодготовка КАК втПериодыДоступности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упСтатусыРемонтовИТОТС.СрезПоследних(
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						втПериодыДоступностиПодготовка.Регистратор
	|					ИЗ
	|						втПериодыДоступностиПодготовка)) КАК упСтатусыСрезПоследних
	|		ПО втПериодыДоступности.Регистратор = упСтатусыСрезПоследних.Документ
	|			И (упСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упСтатусыРемонтаИТОТС.Запланирован))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	втПериодыДоступности.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПериодыДоступности1.Регистратор КАК Регистратор
	|ИЗ
	|	втПериодыДоступности КАК втПериодыДоступности1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериодыДоступности КАК втПериодыДоступности2
	|		ПО (НЕ втПериодыДоступности1.Регистратор = втПериодыДоступности2.Регистратор)
	|			И (ДОБАВИТЬКДАТЕ(втПериодыДоступности1.ДатаНачала, СЕКУНДА, 1) МЕЖДУ втПериодыДоступности2.ДатаНачала И втПериодыДоступности2.ДатаОкончания)"; 
	Запрос.УстановитьПараметр("Гараж", Гараж);
	Запрос.УстановитьПараметр("МестоРемонта", МестоРемонта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ТекстСообщения = НСтр(СтрШаблон("ru = 'Для места ремонта %1 на указанный плановый период уже запланированы другие работы. Проведение не выполнено. %2'", Строка(МестоРемонта), Строка(ДокументОбъект)));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтрольРезультатовПроведения()

#КонецОбласти 

#КонецЕсли
